Repository: bogdanbabych/0945BUT10201-lex2
Catalog: data/s01rawFiles/gnu-en--de-v03.tmx
Source language: en
Languages: de

source: There are cases where using nonfree software puts pressure directly on others to do likewise.
de: Es gibt Fälle, in denen das Benutzen unfreier Software direkten Druck auf andere ausübt es gleichzutun.

source: Skype is a clear example: when one person uses the nonfree Skype client software, it requires another person to use that software too—thus both surrender their freedom.
de: Skype ist ein gutes Beispiel: wenn eine Person die unfreie Skype-Client-Software nutzt, erfordert es eine andere Person, die auch diese Software benutzt ‑ folglich treten beide ihre Freiheit ab (Google Hangouts hat das gleiche Problem).

source: (Google Hangouts have the same problem.) It is wrong even to suggest using such programs.
de: Es ist sogar falsch die Nutzung solcher Programme zu empfehlen.

source: We should refuse to use them even briefly, even on someone else's computer.
de: Wir sollten uns weigern, sie auch nur kurzzeitig, sogar auf dem Rechner einer anderen Person, zu benutzen.

source: Another harm of using nonfree programs and SaaSS is that it rewards the perpetrator, encouraging further development of that program or “service”, leading in turn to even more people falling under the company's thumb.
de: Ein weiterer Schaden durch unfreie Programme und SaaSS ist, dass der Übeltäter den Lohn erntet, die Weiterentwicklung des Programms oder des „Dienstes‘ ermutigend, was wiederum zu noch mehr Personen führt, die unter dem Daumen des Unternehmens beherrscht werden.

source: All the forms of indirect harm are magnified when the user is a public entity or a school.
de: Alle Formen des indirekten Schadens werden verstärkt, wenn der Nutzer eine öffentliche Einrichtung oder eine Schule ist.

source: Free Software and the State Public agencies exist for the people, not for themselves. When they do computing, they do it for the people.
de: Freie Software und der Staat Öffentliche Einrichtungen gibt es für die Menschen, nicht für sich selbst. Wenn sie Daten verarbeiten, tun sie es für die Menschen.

source: They have a duty to maintain full control over that computing so that they can assure it is done properly for the people.
de: Sie haben die Pflicht, die vollständige Kontrolle über die Datenverarbeitung aufrechtzuerhalten, so dass sie versichern können, dass sie richtig für die Menschen erledigt wird (hierbei handelt es sich um die Souveränität des Staates bei der Datenverarbeitung).

source: (This constitutes the computational sovereignty of the state.) They must never allow control over the state's computing to fall into private hands.
de: Man darf auf keinen Fall zulassen, dass die Kontrolle des Staates über die Datenverarbeitung in private Hände fällt.

source: To maintain control of the people's computing, public agencies must not do it with proprietary software (software under the control of an entity other than the state).
de: Um die Kontrolle über die Datenverarbeitung der Menschen zu behalten, dürfen öffentliche Einrichtungen dies nicht mit proprietärer Software tun (Software, die unter der Kontrolle eines anderen als dem Staat ist).

source: And they must not entrust it to a service programmed and run by an entity other than the state, since this would be SaaSS.
de: Und sie dürfen sie nicht einem Dienst anvertrauen, der von einem anderen als dem Staat programmiert und betrieben wird, denn das wäre SaaSS.

source: Proprietary software has no security at all in one crucial case — against its developer.
de: In einem entscheidenden Fall bietet proprietäre Software überhaupt keine Sicherheit ‑ gegen seinen Entwickler.

source: And the developer may help others attack.
de: Und der Entwickler könnte anderen zu Angriffen verhelfen.

source: Microsoft shows Windows bugs to the NSA (the US government digital spying agency) before fixing them.
de: Microsoft zeigt Windows-Programmfehler der NSA (der digitalen Spionagagentur der US-Regierung), bevor es sie behebt.

source: We do not know whether Apple does likewise, but it is under the same government pressure as Microsoft.
de: Wir wissen nicht, ob gleiches für Apple gilt, aber sie stehen unter dem gleichen Druck der US-Regierung wie Microsoft.

source: If the government of any other country uses such software, it endangers national security.
de: Wenn die Regierung irgendeines anderen Landes solche Software benutzt, gefährdet es die nationale Sicherheit.

source: Do you want the NSA to break into your government's computers?
de: Möchten Sie, dass die NSA in die Rechner Ihrer Regierung einbricht?

source: See our suggested policies for governments to promote free software.
de: Siehe unsere Maßnahmen die Regierungen ergreifen können, um Freie Software zu fördern.

source: Free Software and Education Schools (and this includes all educational activities) influence the future of society through what they teach.
de: Freie Software und Bildung Schulen (und dazu gehören alle Aktivitäten im Bildungsbereich) beeinflussen die Zukunft der Gesellschaft durch das, was sie lehren.

source: They should teach exclusively free software, so as to use their influence for the good.
de: Sie sollten ausschließlich freie Software lehren, um ihren Einfluss für das Gute zu verwenden.

source: To teach a proprietary program is to implant dependence, which goes against the mission of education.
de: Ein proprietäres Programm zu lehren bedeutet, Abhängigkeit einzuimpfen, was gegen den Bildungsauftrag verstößt.

source: By training in use of free software, schools will direct society's future towards freedom, and help talented programmers master the craft.
de: Durch Schulung beim Gebrauch von freier Software werden Schulen die Zukunft der Gesellschaft in Richtung Freiheit leiten und damit talentierten Programmierern helfen, das Handwerk zu meistern.

source: They will also teach students the habit of cooperating, helping other people.
de: Sie werden Schülern auch die Gewohnheit zur Zusammenarbeit lehren, anderen helfend.

source: Each class should have this rule: “Students, this class is a place where we share our knowledge.
de: Jede Klasse sollte diese Regel haben: “Liebe Schülerschaft, diese Klasse ist ein Ort, an dem wir unser Wissen teilen.

source: If you bring software to class, you may not keep it for yourself.
de: Wenn zum Unterricht Software mitgebracht wird, darf sie nicht für sich behalten.

source: Rather, you must share copies with the rest of the class—including the program's source code, in case someone else wants to learn.
de: Vielmehr müssen Programmkopien einschließlich -quellcodes mit dem Rest der Klasse geteilt werden, falls jemand anderes davon lernen möchte.

source: Therefore, bringing proprietary software to class is not permitted except to reverse engineer it.”
de: Daher ist das Mitbringen proprietärer Software zum Unterricht nicht erlaubt, es sei denn, sie wird zur Nachkonstruktion benötigt.”

source: Proprietary developers would have us punish students who are good enough at heart to share software and thwart those curious enough to want to change it.
de: Proprietäre Entwickler würden uns die Schülerschaft bestrafen lassen, die im Innersten gut genug sind, um Software zu teilen, und diejenigen zu durchkreuzen, die neugierig genug sind, um es ändern zu wollen.

source: This means a bad education.
de: Dies bedeutet eine schlechte Bildung.

source: See http://www.gnu.org/education/ for more discussion of the use of free software in schools.
de: Siehe https://www.gnu.org/education/ für mehr Diskussionen über die Freie-Software-Nutzung an Schulen.

source: Free Software: More Than “Advantages” I'm often asked to describe the “advantages” of free software.
de: Freie Software: Mehr als “Vorteile” Ich werde oft darum gebeten, die „Vorteile“ freier Software zu beschreiben.

source: But the word “advantages” is too weak when it comes to freedom.
de: Doch das Wort Vorteile ist nicht aussagekräftig genug, wenn es um Freiheit geht.

source: Life without freedom is oppression, and that applies to computing as well as every other activity in our lives.
de: Ein Leben ohne Freiheit heißt Unterdrückung, und das gilt für die Datenverarbeitung genauso wie auch für jede andere Tätigkeit in unserem Leben.

source: We must refuse to give the developers of the programs or computing services control over the computing we do.
de: Wir müssen uns dagegen wehren, den Programmentwicklern oder Datenverarbeitungsdiensten die Kontrolle über unsere Datenverarbeitung zu überlassen.

source: This is the right thing to do, for selfish reasons; but not solely for selfish reasons.
de: Aus egoistischen Gründen ist das der richtige Schritt, aber nicht nur aus egoistischen Gründen.

source: Freedom includes the freedom to cooperate with others.
de: Freiheit schließt die Freiheit ein, mit anderen zusammenzuarbeiten.

source: Denying people that freedom means keeping them divided, which is the start of a scheme to oppress them.
de: Diese Freiheit leugnen bedeutet sie gespalten zu halten, welches der Anfang eines Schemas ist, sie zu unterdrücken.

source: In the free software community, we are very much aware of the importance of the freedom to cooperate because our work consists of organized cooperation.
de: In der Freie Software-Gemeinschaft ist uns die Wichtigkeit der Freiheit zur Zusammenarbeit deutlich bewusst, weil unsere Arbeit aus organisierter Zusammenarbeit besteht.

source: If your friend comes to visit and sees you use a program, she might ask for a copy.
de: Wenn ein Freund oder eine Freundin zu Besuch kommt und Sie ein Programm benutzen sieht, könnte er oder sie um eine Kopie bitten.

source: A program which stops you from redistributing it, or says you're “not supposed to”, is antisocial.
de: Ein Programm, das davon abhält es weiterzugeben oder „eigentlich nicht“ sagt, ist unsozial.

source: In computing, cooperation includes redistributing exact copies of a program to other users.
de: In der Datenverarbeitung schließt Zusammenarbeit die Weitergabe exakter Kopien eines Programms an andere Nutzer ein.

source: It also includes distributing your changed versions to them.
de: Es schließt auch die Verteilung von selbst geänderten Versionen ein.

source: Free software encourages these forms of cooperation, while proprietary software forbids them.
de: Freie Software fördert diese Formen der Zusammenarbeit, während proprietäre Software sie verbietet.

source: It forbids redistribution of copies, and by denying users the source code, it blocks them from making changes.
de: Sie verbietet die Weitergabe von Kopien und dadurch, dass sie Nutzern den Quellcode versagt, hindert es sie, Änderungen vorzunehmen.

source: SaaSS has the same effects: if your computing is done over the web in someone else's server, by someone else's copy of a program, you can't see it or touch the software that does your computing, so you can't redistribute it or change it.
de: SaaSS hat die gleichen Auswirkungen: erfolgt die Datenverarbeitung über das Internet auf dem Server bei jemand anderem, durch eine von jemand anderem gemachte Kopie eines Programms, ist die Software dahinter, die die Datenverarbeitung vornimmt, weder einseh- noch greifbar, man kann sie also nicht weitergeben oder ändern.

source: Conclusion We deserve to have control of our own computing; how can we win this control?
de: Fazit Wir verdienen es, Kontrolle über unsere eigene Datenverarbeitung zu haben. Wie können wir diese Kontrolle gewinnen?

source: By rejecting nonfree software on the computers we own or regularly use, and rejecting SaaSS.
de: Durch Zurückweisen unfreier Software auf den Rechnern, die wir besitzen oder regelmäßig benutzen, und Zurückweisen von SaaSS. Durch das Entwickeln freier Software (für diejenigen unter uns, die Programmierer sind).

source: By developing free software (for those of us who are programmers.) By refusing to develop or promote nonfree software or SaaSS.
de: Durch die Weigerung, unfreie Software oder SaaSS zu entwickeln oder zu fördern.

source: By spreading these ideas to others.
de: Durch das Verbreiten dieser Ideen an Andere.

source: We and thousands of users have done this since 1984, which is how we now have the free GNU/Linux operating system that anyone—programmer or not—can use.
de: Wir und Tausende von Nutzern haben dies seit 1984 gemacht, so wie wir nun das freie GNU/Linux-Betriebssystem haben, das jedermann ‑ Programmierer oder nicht ‑ benutzen kann.

source: Join our cause, as a programmer or an activist.
de: Schließen Sie sich unserer Sache an, als Programmierer oder Aktivist!

source: Let's make all computer users free.
de: Machen wir alle Rechnernutzer frei.

source: The GNU Project by Richard Stallman
de: Über das Projekt ‚GNU‘ von Richard Stallman

source: Originally published in the book Open Sources.
de: Die englische Originalausgabe wurde in dem Buch Open Sources veröffentlicht.

source: Richard Stallman was never a supporter of “open source”, but contributed this article so that the ideas of the free software movement would not be entirely absent from that book.
de: Richard Stallman war nie ein Anhänger von „Open Source“;, trug aber diesen Artikel bei, damit die Anschauungen der Freie-Software-Bewegung nicht völlig fehlen würden.

source: Why it is even more important than ever to insist that the software we use be free.
de: Bitte beachten Sie auch den Aufsatz Freie Software ist jetzt sogar noch wichtiger denn je, denn wir sollten auf Software ‑ Software die wir nutzen!

source: The first software-sharing community When I started working at the MIT Artificial Intelligence Lab in 1971, I became part of a software-sharing community that had existed for many years.
de: ‑ bestehen, die frei ist.

source: Sharing of software was not limited to our particular community; it is as old as computers, just as sharing of recipes is as old as cooking. But we did it more than most.
de: Die erste Software-teilende Gemeinschaft Als ich 1971 am Artificial Intelligence Laboratory (AI Lab) des Massachusetts Institute of Technology anfing zu arbeiten, wurde ich Teil einer Software-teilenden Gemeinschaft, die schon seit Jahren existierte.

source: The AI Lab used a timesharing operating system called ITS (the Incompatible Timesharing System) that the lab's staff hackers (1) had designed and written in assembler language for the Digital PDP-10, one of the large computers of the era.
de: Die gemeinsame Nutzung von Software war nicht nur auf unsere besondere Gemeinschaft beschränkt; sie ist so alt wie Rechner selbst, genauso wie der Austausch von Kochrezepten so alt wie das Kochen ist.

source: As a member of this community, an AI Lab staff system hacker, my job was to improve this system.
de: Aber wir praktizierten es mehr als die meisten.

source: We did not call our software “free software”, because that term did not yet exist; but that is what it was.
de: Das AI Lab verwendete ein Mehrbenutzer-Betriebssystem namens Incompatible Timesharing System (ITS), welches die Hacker(1) des Laborpersonals in der Programmiersprache Assembler für den Digital PDP-10, einen der großen Rechner dieser Ära, entworfen und geschrieben hatten.

source: Whenever people from another university or a company wanted to port and use a program, we gladly let them.
de: Als Mitglied dieser Gemeinschaft, ein angestellter Systemhacker des AI Labs, war es meine Aufgabe dieses System zu verbessern.

source: If you saw someone using an unfamiliar and interesting program, you could always ask to see the source code, so that you could read it, change it, or cannibalize parts of it to make a new program.
de: Wir nannten unsere Software nicht Freie Software, da dieser Ausdruck noch nicht geprägt war, aber das ist es, was sie war.

source: (1) The use of “hacker” to mean “security breaker” is a confusion on the part of the mass media.
de: Wann immer jemand von einer anderen Universität oder einer Firma ein Programm portieren und benutzen wollte, freute uns das und wir ließen sie gewähren.

source: We hackers refuse to recognize that meaning, and continue using the word to mean someone who loves to program, someone who enjoys playful cleverness, or the combination of the two. See my article, On Hacking.
de: Wenn man jemanden ein unbekanntes interessantes Programm benutzen sah, konnte man immer den Quellcode bekommen, sodass man diesen lesen, verändern oder sogar Teile davon für neue Programme ausschlachten konnte.

source: The collapse of the community The situation changed drastically in the early 1980s when Digital discontinued the PDP-10 series.
de: Der Zusammenbruch der Gemeinschaft Die Situation änderte sich Anfang der 80er Jahre drastisch, als Digital die PDP-10-Serie einstellte.

source: Its architecture, elegant and powerful in the 60s, could not extend naturally to the larger address spaces that were becoming feasible in the 80s.
de: Ihre Architektur, elegant und leistungsfähig in den 60ern, konnte natürlich nicht auf größere Adressräume erweitert werden, welche in den 80ern möglich wurden.

source: This meant that nearly all of the programs composing ITS were obsolete.
de: Das bedeutete, dass nahezu alle im ITS zusammengesetzten Programme veraltet waren.

source: The AI Lab hacker community had already collapsed, not long before.
de: Die Hacker-Gemeinschaft des AI Labs war bereits kurz vorher zusammengebrochen.

source: In 1981, the spin-off company Symbolics had hired away nearly all of the hackers from the AI Lab, and the depopulated community was unable to maintain itself.
de: Im Jahr 1981 hatte das ausgegliederte Unternehmen Symbolics fast alle Hacker aus dem AI Lab abgeworben, und die entvölkerte Gemeinschaft war außerstande, sich zu behaupten (das Buch Hackers von Steve Levy beschreibt diese Ereignisse sowie ein klares Bild dieser Gemeinschaft in ihrer Blütezeit).

source: (The book Hackers, by Steve Levy, describes these events, as well as giving a clear picture of this community in its prime.) When the AI Lab bought a new PDP-10 in 1982, its administrators decided to use Digital's nonfree timesharing system instead of ITS.
de: Als das AI Lab 1982 einen neuen PDP-10 kaufte, entschieden dessen Administratoren, Digitals unfreies Mehrbenutzer-Betriebssystem anstatt ITS zu benutzen.

source: The modern computers of the era, such as the VAX or the 68020, had their own operating systems, but none of them were free software: you had to sign a nondisclosure agreement even to get an executable copy.
de: Die modernen Rechner dieser Ära, wie der VAX oder der 68020, hatten eigene Betriebssysteme, aber keines war freie Software: man musste sogar eine Vertraulichkeitsvereinbarung unterzeichnen, nur um eine ausführbare Kopie zu erhalten.

source: This meant that the first step in using a computer was to promise not to help your neighbor.
de: Das bedeutete, dass der erste Schritt zur Benutzung eines Rechners darin bestand zu versprechen, seinen Nächsten nicht zu helfen.

source: A cooperating community was forbidden.
de: Eine zusammenarbeitende Gemeinschaft war verboten.

source: The rule made by the owners of proprietary software was, “If you share with your neighbor, you are a pirate.
de: Die Vorschrift von Eigentümern proprietärer Software war: „Wenn Sie mit ihrem Nächsten teilen, sind Sie ein Softwarepirat.

source: If you want any changes, beg us to make them.”
de: Möchten Sie irgendwelche Änderungen, bitten Sie uns, diese vorzunehmen.“

source: The idea that the proprietary software social system—the system that says you are not allowed to share or change software—is antisocial, that it is unethical, that it is simply wrong, may come as a surprise to some readers.
de: Die Idee, dass das proprietäre Software-Sozialsystem ‑ das System, was besagt, man sei nicht berechtigt Software zu teilen oder zu verändern ‑ unsozial, unethisch und einfach falsch ist, mag einige überraschen.

source: But what else could we say about a system based on dividing the public and keeping users helpless?
de: Aber was könnten wir sonst über ein System sagen, was darauf basiert die Allgemeinheit zu spalten und Nutzer hilflos zu halten?

source: Readers who find the idea surprising may have taken the proprietary software social system as a given, or judged it on the terms suggested by proprietary software businesses.
de: Leserinnen und Leser, die diesen Gedanken überraschend finden, haben das proprietäre Software-Sozialsystem möglicherweise als gegeben angesehen oder es unter den von den proprietären Softwareunternehmen vorgeschlagenen Begriffen beurteilt.

source: Software publishers have worked long and hard to convince people that there is only one way to look at the issue.
de: Softwarehersteller haben lange und hart daran gearbeitet Menschen davon zu überzeugen, es gäbe nur einen Blickwinkel auf dieses Problem.

source: When software publishers talk about “enforcing” their “rights” or “stopping piracy”, what they actually say is secondary.
de: Wenn Softwarehersteller über „Durchsetzung“ ihrer „Rechte“ oder Verhinderung von „Softwarepiraterie“ sprechen, ist das, was sie wirklich meinen, zweitrangig.

source: The real message of these statements is in the unstated assumptions they take for granted, which the public is asked to accept without examination.
de: Die eigentliche Botschaft dieser Aussagen ist die unausgesprochene, für selbstverständlich gehaltene Annahme, die Öffentlichkeit aufzufordern, diese ungeprüft zu akzeptieren.

source: Let's therefore examine them.
de: Betrachten wir sie deshalb etwas näher.

source: One assumption is that software companies have an unquestionable natural right to own software and thus have power over all its users.
de: Eine Annahme ist, dass Softwareunternehmen ein unbestreitbares natürliches Recht auf eigene Software und damit Macht über alle ihre Benutzer haben (wenn dies ein natürliches Recht wäre, ganz gleich wie viel Schaden es für die Öffentlichkeit bedeutet, könnten wir nichts dagegen machen).

source: (If this were a natural right, then no matter how much harm it does to the public, we could not object.) Interestingly, the US Constitution and legal tradition reject this view; copyright is not a natural right, but an artificial government-imposed monopoly that limits the users' natural right to copy.
de: Interessanterweise lehnen die US-Verfassung und rechtliche Traditionen diese Auffassung ab. Urheberrecht ist kein natürliches Recht, sondern ein vom Staat künstlich auferlegtes Monopol, das Benutzern das natürliche Recht zu kopieren eingrenzt.

source: Another unstated assumption is that the only important thing about software is what jobs it allows you to do—that we computer users should not care what kind of society we are allowed to have.
de: Eine weitere unausgesprochene Annahme ist, dass es bei Software nur wichtig ist, welche Aufgaben sie einem erlaubt auszuführen ‑ das wir Rechnernutzer uns nicht darum kümmern sollten, was für eine Gesellschaft wir haben dürfen.

source: A third assumption is that we would have no usable software (or would never have a program to do this or that particular job) if we did not offer a company power over the users of the program.
de: Eine dritte Annahme ist, dass wir keine brauchbare Software haben würden (oder niemals ein Programm haben würden, um die eine oder andere Aufgabe zu erledigen), wenn wir einem Unternehmen nicht die Macht über die Benutzer des Programms geben würden.

source: This assumption may have seemed plausible, before the free software movement demonstrated that we can make plenty of useful software without putting chains on it.
de: Diese Annahme mag ganz plausibel gewesen sein, bevor die Freie-Software-Bewegung gezeigt hat, dass wir eine Menge nützlicher Software entwickeln können, ohne sie an Ketten zu legen.
